app/controllers/boards_controller.rb

    def index_patient_board

        @patient_plan  = nil
        @appointment = nil
        @user = User.find(current_user.id)
        @offers = Offer.where("status = ?", "Activo")

        if @user.patient
            patient_plan_date = PatientPlan.where("patient_id = ?", @user.patient.id).maximum(:created_at)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "offers".* FROM "offers" WHERE (status = 'Activo')
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = $1 LIMIT $2  [["user_id", 9], ["LIMIT", 1]]