app/controllers/sessions_controller.rb

  def destroy
    #super
    @user = User.where("email = ?", current_user.email)
    @user[0].update_attribute :login_status, 'Logout'
---
SELECT "users".* FROM "users" WHERE (email = 'edgar4@gmail.com')
UPDATE "users" SET "login_status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["login_status", "Logout"], ["updated_at", "2021-10-26 15:51:26.028175"], ["id", 9]]